4ms/metamodule/firmware/lib/cmsis-device/stm32mp157c/include/stm32mp157cxx_cm4_regs06.h
/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RCC_TZCR register********************/
#define RCC_TZCR_TZEN_Pos                         (0U)
#define RCC_TZCR_TZEN_Msk                         (0x1U << RCC_TZCR_TZEN_Pos)                        /*!< 0x00000001 */
#define RCC_TZCR_TZEN                             RCC_TZCR_TZEN_Msk                                  /*!< RCC TrustZone (secure) Enable */
#define RCC_TZCR_MCKPROT_Pos                      (1U)
#define RCC_TZCR_MCKPROT_Msk                      (0x1U << RCC_TZCR_MCKPROT_Pos)                     /*!< 0x00000002 */
#define RCC_TZCR_MCKPROT                          RCC_TZCR_MCKPROT_Msk                               /*!< Protection of the generation of mcuss_ck clock (secure) Enable */

/*****************  Bit definition for RCC_OCENSETR register  *****************/
#define RCC_OCENSETR_HSION_Pos                    (0U)
#define RCC_OCENSETR_HSION_Msk                    (0x1U << RCC_OCENSETR_HSION_Pos)                   /*!< 0x00000001 */
#define RCC_OCENSETR_HSION                        RCC_OCENSETR_HSION_Msk                             /*!< Set HSION bit */
#define RCC_OCENSETR_HSIKERON_Pos                 (1U)
#define RCC_OCENSETR_HSIKERON_Msk                 (0x1U << RCC_OCENSETR_HSIKERON_Pos)                /*!< 0x00000002 */
#define RCC_OCENSETR_HSIKERON                     RCC_OCENSETR_HSIKERON_Msk                          /*!< Set HSIKERON bit */
#define RCC_OCENSETR_CSION_Pos                    (4U)
#define RCC_OCENSETR_CSION_Msk                    (0x1U << RCC_OCENSETR_CSION_Pos)                   /*!< 0x00000010 */
#define RCC_OCENSETR_CSION                        RCC_OCENSETR_CSION_Msk                             /*!< Set CSION bit */
#define RCC_OCENSETR_CSIKERON_Pos                 (5U)
#define RCC_OCENSETR_CSIKERON_Msk                 (0x1U << RCC_OCENSETR_CSIKERON_Pos)                /*!< 0x00000020 */
#define RCC_OCENSETR_CSIKERON                     RCC_OCENSETR_CSIKERON_Msk                          /*!< Set CSIKERON bit */
#define RCC_OCENSETR_DIGBYP_Pos                   (7U)
#define RCC_OCENSETR_DIGBYP_Msk                   (0x1U << RCC_OCENSETR_DIGBYP_Pos)                  /*!< 0x00000080 */
#define RCC_OCENSETR_DIGBYP                       RCC_OCENSETR_DIGBYP_Msk                            /*!< Set DIGBYP bit */
#define RCC_OCENSETR_HSEON_Pos                    (8U)
#define RCC_OCENSETR_HSEON_Msk                    (0x1U << RCC_OCENSETR_HSEON_Pos)                   /*!< 0x00000100 */
#define RCC_OCENSETR_HSEON                        RCC_OCENSETR_HSEON_Msk                             /*!< Set HSEON bit */
#define RCC_OCENSETR_HSEKERON_Pos                 (9U)
#define RCC_OCENSETR_HSEKERON_Msk                 (0x1U << RCC_OCENSETR_HSEKERON_Pos)                /*!< 0x00000200 */
#define RCC_OCENSETR_HSEKERON                     RCC_OCENSETR_HSEKERON_Msk                          /*!< Set HSEKERON bit */
#define RCC_OCENSETR_HSEBYP_Pos                   (10U)
#define RCC_OCENSETR_HSEBYP_Msk                   (0x1U << RCC_OCENSETR_HSEBYP_Pos)                  /*!< 0x00000400 */
#define RCC_OCENSETR_HSEBYP                       RCC_OCENSETR_HSEBYP_Msk                            /*!< Set HSEBYP bit */
#define RCC_OCENSETR_HSECSSON_Pos                 (11U)
#define RCC_OCENSETR_HSECSSON_Msk                 (0x1U << RCC_OCENSETR_HSECSSON_Pos)                /*!< 0x00000800 */
#define RCC_OCENSETR_HSECSSON                     RCC_OCENSETR_HSECSSON_Msk                          /*!< Set the HSECSSON bit */

/*****************  Bit definition for RCC_OCENCLRR register  *****************/
#define RCC_OCENCLRR_HSION_Pos                    (0U)
#define RCC_OCENCLRR_HSION_Msk                    (0x1U << RCC_OCENCLRR_HSION_Pos)                   /*!< 0x00000001 */
#define RCC_OCENCLRR_HSION                        RCC_OCENCLRR_HSION_Msk                             /*!< Clear of HSION bit */
#define RCC_OCENCLRR_HSIKERON_Pos                 (1U)
#define RCC_OCENCLRR_HSIKERON_Msk                 (0x1U << RCC_OCENCLRR_HSIKERON_Pos)                /*!< 0x00000002 */
#define RCC_OCENCLRR_HSIKERON                     RCC_OCENCLRR_HSIKERON_Msk                          /*!< Clear of HSIKERON bit */
#define RCC_OCENCLRR_CSION_Pos                    (4U)
#define RCC_OCENCLRR_CSION_Msk                    (0x1U << RCC_OCENCLRR_CSION_Pos)                   /*!< 0x00000010 */
#define RCC_OCENCLRR_CSION                        RCC_OCENCLRR_CSION_Msk                             /*!< Clear of CSION bit */
#define RCC_OCENCLRR_CSIKERON_Pos                 (5U)
#define RCC_OCENCLRR_CSIKERON_Msk                 (0x1U << RCC_OCENCLRR_CSIKERON_Pos)                /*!< 0x00000020 */
#define RCC_OCENCLRR_CSIKERON                     RCC_OCENCLRR_CSIKERON_Msk                          /*!< Clear of CSIKERON bit */
#define RCC_OCENCLRR_DIGBYP_Pos                   (7U)
#define RCC_OCENCLRR_DIGBYP_Msk                   (0x1U << RCC_OCENCLRR_DIGBYP_Pos)                  /*!< 0x00000080 */
#define RCC_OCENCLRR_DIGBYP                       RCC_OCENCLRR_DIGBYP_Msk                            /*!< Clear of DIGBYP bit */
#define RCC_OCENCLRR_HSEON_Pos                    (8U)
#define RCC_OCENCLRR_HSEON_Msk                    (0x1U << RCC_OCENCLRR_HSEON_Pos)                   /*!< 0x00000100 */
#define RCC_OCENCLRR_HSEON                        RCC_OCENCLRR_HSEON_Msk                             /*!< Clear of HSEON bit */
#define RCC_OCENCLRR_HSEKERON_Pos                 (9U)
#define RCC_OCENCLRR_HSEKERON_Msk                 (0x1U << RCC_OCENCLRR_HSEKERON_Pos)                /*!< 0x00000200 */
#define RCC_OCENCLRR_HSEKERON                     RCC_OCENCLRR_HSEKERON_Msk                          /*!< Clear HSEKERON bit */
#define RCC_OCENCLRR_HSEBYP_Pos                   (10U)
#define RCC_OCENCLRR_HSEBYP_Msk                   (0x1U << RCC_OCENCLRR_HSEBYP_Pos)                  /*!< 0x00000400 */
#define RCC_OCENCLRR_HSEBYP                       RCC_OCENCLRR_HSEBYP_Msk                            /*!< Clear the HSEBYP bit */

