4ms/metamodule/firmware/lib/cmsis-device/stm32mp157c/include/stm32mp157cxx_cm4_regs06.h
/******************  Bit definition for RCC_PLL2CR register  ******************/
#define RCC_PLL2CR_PLLON_Pos                      (0U)
#define RCC_PLL2CR_PLLON_Msk                      (0x1U << RCC_PLL2CR_PLLON_Pos)                     /*!< 0x00000001 */
#define RCC_PLL2CR_PLLON                          RCC_PLL2CR_PLLON_Msk                               /*!< PLL2 enable */
#define RCC_PLL2CR_PLL2RDY_Pos                    (1U)
#define RCC_PLL2CR_PLL2RDY_Msk                    (0x1U << RCC_PLL2CR_PLL2RDY_Pos)                   /*!< 0x00000002 */
#define RCC_PLL2CR_PLL2RDY                        RCC_PLL2CR_PLL2RDY_Msk                             /*!< PLL2 clock ready flag */
#define RCC_PLL2CR_SSCG_CTRL_Pos                  (2U)
#define RCC_PLL2CR_SSCG_CTRL_Msk                  (0x1U << RCC_PLL2CR_SSCG_CTRL_Pos)                 /*!< 0x00000004 */
#define RCC_PLL2CR_SSCG_CTRL                      RCC_PLL2CR_SSCG_CTRL_Msk                           /*!< Clock Spreading Generator of PLL2 enable */
#define RCC_PLL2CR_DIVPEN_Pos                     (4U)
#define RCC_PLL2CR_DIVPEN_Msk                     (0x1U << RCC_PLL2CR_DIVPEN_Pos)                    /*!< 0x00000010 */
#define RCC_PLL2CR_DIVPEN                         RCC_PLL2CR_DIVPEN_Msk                              /*!< PLL2 DIVP divider output enable */
#define RCC_PLL2CR_DIVQEN_Pos                     (5U)
#define RCC_PLL2CR_DIVQEN_Msk                     (0x1U << RCC_PLL2CR_DIVQEN_Pos)                    /*!< 0x00000020 */
#define RCC_PLL2CR_DIVQEN                         RCC_PLL2CR_DIVQEN_Msk                              /*!< PLL2 DIVQ divider output enable */
#define RCC_PLL2CR_DIVREN_Pos                     (6U)
#define RCC_PLL2CR_DIVREN_Msk                     (0x1U << RCC_PLL2CR_DIVREN_Pos)                    /*!< 0x00000040 */
#define RCC_PLL2CR_DIVREN                         RCC_PLL2CR_DIVREN_Msk                              /*!< PLL2 DIVR divider output enable */

/****************  Bit definition for RCC_PLL2CFGR1 register  *****************/
#define RCC_PLL2CFGR1_DIVN_Pos                    (0U)
#define RCC_PLL2CFGR1_DIVN_Msk                    (0x1FFU << RCC_PLL2CFGR1_DIVN_Pos)                 /*!< 0x000001FF */
#define RCC_PLL2CFGR1_DIVN                        RCC_PLL2CFGR1_DIVN_Msk                             /*!< Multiplication factor for PLL2 VCO */
#define RCC_PLL2CFGR1_DIVN_0                      (0x1U << RCC_PLL2CFGR1_DIVN_Pos)                   /*!< 0x00000001 */
#define RCC_PLL2CFGR1_DIVN_1                      (0x2U << RCC_PLL2CFGR1_DIVN_Pos)                   /*!< 0x00000002 */
#define RCC_PLL2CFGR1_DIVN_2                      (0x4U << RCC_PLL2CFGR1_DIVN_Pos)                   /*!< 0x00000004 */
#define RCC_PLL2CFGR1_DIVN_3                      (0x8U << RCC_PLL2CFGR1_DIVN_Pos)                   /*!< 0x00000008 */
#define RCC_PLL2CFGR1_DIVN_4                      (0x10U << RCC_PLL2CFGR1_DIVN_Pos)                  /*!< 0x00000010 */
#define RCC_PLL2CFGR1_DIVN_5                      (0x20U << RCC_PLL2CFGR1_DIVN_Pos)                  /*!< 0x00000020 */
#define RCC_PLL2CFGR1_DIVN_6                      (0x40U << RCC_PLL2CFGR1_DIVN_Pos)                  /*!< 0x00000040 */
#define RCC_PLL2CFGR1_DIVN_7                      (0x80U << RCC_PLL2CFGR1_DIVN_Pos)                  /*!< 0x00000080 */
#define RCC_PLL2CFGR1_DIVN_8                      (0x100U << RCC_PLL2CFGR1_DIVN_Pos)                 /*!< 0x00000100 */
#define RCC_PLL2CFGR1_DIVM2_Pos                   (16U)
#define RCC_PLL2CFGR1_DIVM2_Msk                   (0x3FU << RCC_PLL2CFGR1_DIVM2_Pos)                 /*!< 0x003F0000 */
#define RCC_PLL2CFGR1_DIVM2                       RCC_PLL2CFGR1_DIVM2_Msk                            /*!< Prescaler for PLL2 */
#define RCC_PLL2CFGR1_DIVM2_0                     (0x1U << RCC_PLL2CFGR1_DIVM2_Pos)              /*!< 0x00010000 */
#define RCC_PLL2CFGR1_DIVM2_1                     (0x2U << RCC_PLL2CFGR1_DIVM2_Pos)              /*!< 0x00020000 */
#define RCC_PLL2CFGR1_DIVM2_2                     (0x4U << RCC_PLL2CFGR1_DIVM2_Pos)              /*!< 0x00040000 */
#define RCC_PLL2CFGR1_DIVM2_3                     (0x8U << RCC_PLL2CFGR1_DIVM2_Pos)              /*!< 0x00080000 */
#define RCC_PLL2CFGR1_DIVM2_4                     (0x10U << RCC_PLL2CFGR1_DIVM2_Pos)             /*!< 0x00100000 */
#define RCC_PLL2CFGR1_DIVM2_5                     (0x20U << RCC_PLL2CFGR1_DIVM2_Pos)             /*!< 0x00200000 */

/****************  Bit definition for RCC_PLL2CFGR2 register  *****************/
#define RCC_PLL2CFGR2_DIVP_Pos                    (0U)
#define RCC_PLL2CFGR2_DIVP_Msk                    (0x7FU << RCC_PLL2CFGR2_DIVP_Pos)                  /*!< 0x0000007F */
#define RCC_PLL2CFGR2_DIVP                        RCC_PLL2CFGR2_DIVP_Msk                             /*!< PLL2 DIVP division factor */
#define RCC_PLL2CFGR2_DIVP_0                      (0x1U << RCC_PLL2CFGR2_DIVP_Pos)                   /*!< 0x00000001 */
#define RCC_PLL2CFGR2_DIVP_1                      (0x2U << RCC_PLL2CFGR2_DIVP_Pos)                   /*!< 0x00000002 */
#define RCC_PLL2CFGR2_DIVP_2                      (0x4U << RCC_PLL2CFGR2_DIVP_Pos)                   /*!< 0x00000004 */
#define RCC_PLL2CFGR2_DIVP_3                      (0x8U << RCC_PLL2CFGR2_DIVP_Pos)                   /*!< 0x00000008 */
#define RCC_PLL2CFGR2_DIVP_4                      (0x10U << RCC_PLL2CFGR2_DIVP_Pos)                  /*!< 0x00000010 */
#define RCC_PLL2CFGR2_DIVP_5                      (0x20U << RCC_PLL2CFGR2_DIVP_Pos)                  /*!< 0x00000020 */
#define RCC_PLL2CFGR2_DIVP_6                      (0x40U << RCC_PLL2CFGR2_DIVP_Pos)                  /*!< 0x00000040 */
#define RCC_PLL2CFGR2_DIVQ_Pos                    (8U)
#define RCC_PLL2CFGR2_DIVQ_Msk                    (0x7FU << RCC_PLL2CFGR2_DIVQ_Pos)                  /*!< 0x00007F00 */
#define RCC_PLL2CFGR2_DIVQ                        RCC_PLL2CFGR2_DIVQ_Msk                             /*!< PLL2 DIVQ division factor */
#define RCC_PLL2CFGR2_DIVQ_0                      (0x1U << RCC_PLL2CFGR2_DIVQ_Pos)                 /*!< 0x00000100 */
#define RCC_PLL2CFGR2_DIVQ_1                      (0x2U << RCC_PLL2CFGR2_DIVQ_Pos)                 /*!< 0x00000200 */
#define RCC_PLL2CFGR2_DIVQ_2                      (0x4U << RCC_PLL2CFGR2_DIVQ_Pos)                 /*!< 0x00000400 */
#define RCC_PLL2CFGR2_DIVQ_3                      (0x8U << RCC_PLL2CFGR2_DIVQ_Pos)                 /*!< 0x00000800 */
#define RCC_PLL2CFGR2_DIVQ_4                      (0x10U << RCC_PLL2CFGR2_DIVQ_Pos)                /*!< 0x00001000 */
#define RCC_PLL2CFGR2_DIVQ_5                      (0x20U << RCC_PLL2CFGR2_DIVQ_Pos)                /*!< 0x00002000 */
#define RCC_PLL2CFGR2_DIVQ_6                      (0x40U << RCC_PLL2CFGR2_DIVQ_Pos)                /*!< 0x00004000 */
#define RCC_PLL2CFGR2_DIVR_Pos                    (16U)
#define RCC_PLL2CFGR2_DIVR_Msk                    (0x7FU << RCC_PLL2CFGR2_DIVR_Pos)                  /*!< 0x007F0000 */
#define RCC_PLL2CFGR2_DIVR                        RCC_PLL2CFGR2_DIVR_Msk                             /*!< PLL2 DIVR division factor */
#define RCC_PLL2CFGR2_DIVR_0                      (0x1U << RCC_PLL2CFGR2_DIVR_Pos)               /*!< 0x00010000 */
#define RCC_PLL2CFGR2_DIVR_1                      (0x2U << RCC_PLL2CFGR2_DIVR_Pos)               /*!< 0x00020000 */
#define RCC_PLL2CFGR2_DIVR_2                      (0x4U << RCC_PLL2CFGR2_DIVR_Pos)               /*!< 0x00040000 */
#define RCC_PLL2CFGR2_DIVR_3                      (0x8U << RCC_PLL2CFGR2_DIVR_Pos)               /*!< 0x00080000 */
#define RCC_PLL2CFGR2_DIVR_4                      (0x10U << RCC_PLL2CFGR2_DIVR_Pos)              /*!< 0x00100000 */
#define RCC_PLL2CFGR2_DIVR_5                      (0x20U << RCC_PLL2CFGR2_DIVR_Pos)              /*!< 0x00200000 */
#define RCC_PLL2CFGR2_DIVR_6                      (0x40U << RCC_PLL2CFGR2_DIVR_Pos)              /*!< 0x00400000 */

/****************  Bit definition for RCC_PLL2FRACR register  *****************/
#define RCC_PLL2FRACR_FRACV_Pos                   (3U)
#define RCC_PLL2FRACR_FRACV_Msk                   (0x1FFFU << RCC_PLL2FRACR_FRACV_Pos)               /*!< 0x0000FFF8 */
#define RCC_PLL2FRACR_FRACV                       RCC_PLL2FRACR_FRACV_Msk                            /*!< Fractional part of the multiplication factor for PLL2 VCO */
#define RCC_PLL2FRACR_FRACV_0                     (0x1U << RCC_PLL2FRACR_FRACV_Pos)                  /*!< 0x00000008 */
#define RCC_PLL2FRACR_FRACV_1                     (0x2U << RCC_PLL2FRACR_FRACV_Pos)                 /*!< 0x00000010 */
#define RCC_PLL2FRACR_FRACV_2                     (0x4U << RCC_PLL2FRACR_FRACV_Pos)                 /*!< 0x00000020 */
#define RCC_PLL2FRACR_FRACV_3                     (0x8U << RCC_PLL2FRACR_FRACV_Pos)                 /*!< 0x00000040 */
#define RCC_PLL2FRACR_FRACV_4                     (0x10U << RCC_PLL2FRACR_FRACV_Pos)                 /*!< 0x00000080 */
#define RCC_PLL2FRACR_FRACV_5                     (0x20U << RCC_PLL2FRACR_FRACV_Pos)                /*!< 0x00000100 */
#define RCC_PLL2FRACR_FRACV_6                     (0x40U << RCC_PLL2FRACR_FRACV_Pos)                /*!< 0x00000200 */
#define RCC_PLL2FRACR_FRACV_7                     (0x80U << RCC_PLL2FRACR_FRACV_Pos)                /*!< 0x00000400 */
#define RCC_PLL2FRACR_FRACV_8                     (0x100U << RCC_PLL2FRACR_FRACV_Pos)                /*!< 0x00000800 */
#define RCC_PLL2FRACR_FRACV_9                     (0x200U << RCC_PLL2FRACR_FRACV_Pos)               /*!< 0x00001000 */
#define RCC_PLL2FRACR_FRACV_10                    (0x400U << RCC_PLL2FRACR_FRACV_Pos)               /*!< 0x00002000 */
#define RCC_PLL2FRACR_FRACV_11                    (0x800U << RCC_PLL2FRACR_FRACV_Pos)               /*!< 0x00004000 */
#define RCC_PLL2FRACR_FRACV_12                    (0x1000U << RCC_PLL2FRACR_FRACV_Pos)               /*!< 0x00008000 */
#define RCC_PLL2FRACR_FRACLE_Pos                  (16U)
#define RCC_PLL2FRACR_FRACLE_Msk                  (0x1U << RCC_PLL2FRACR_FRACLE_Pos)                 /*!< 0x00010000 */
#define RCC_PLL2FRACR_FRACLE                      RCC_PLL2FRACR_FRACLE_Msk                           /*!< PLL2 fractional latch enable */

/*****************  Bit definition for RCC_PLL2CSGR register  *****************/
#define RCC_PLL2CSGR_MOD_PER_Pos                  (0U)
#define RCC_PLL2CSGR_MOD_PER_Msk                  (0x1FFFU << RCC_PLL2CSGR_MOD_PER_Pos)              /*!< 0x00001FFF */
#define RCC_PLL2CSGR_MOD_PER                      RCC_PLL2CSGR_MOD_PER_Msk                           /*!< Modulation Period Adjustment for PLL2 */
#define RCC_PLL2CSGR_MOD_PER_0                    (0x1U << RCC_PLL2CSGR_MOD_PER_Pos)                 /*!< 0x00000001 */
#define RCC_PLL2CSGR_MOD_PER_1                    (0x2U << RCC_PLL2CSGR_MOD_PER_Pos)                 /*!< 0x00000002 */
#define RCC_PLL2CSGR_MOD_PER_2                    (0x4U << RCC_PLL2CSGR_MOD_PER_Pos)                 /*!< 0x00000004 */
#define RCC_PLL2CSGR_MOD_PER_3                    (0x8U << RCC_PLL2CSGR_MOD_PER_Pos)                 /*!< 0x00000008 */
#define RCC_PLL2CSGR_MOD_PER_4                    (0x10U << RCC_PLL2CSGR_MOD_PER_Pos)                /*!< 0x00000010 */
#define RCC_PLL2CSGR_MOD_PER_5                    (0x20U << RCC_PLL2CSGR_MOD_PER_Pos)                /*!< 0x00000020 */
#define RCC_PLL2CSGR_MOD_PER_6                    (0x40U << RCC_PLL2CSGR_MOD_PER_Pos)                /*!< 0x00000040 */
#define RCC_PLL2CSGR_MOD_PER_7                    (0x80U << RCC_PLL2CSGR_MOD_PER_Pos)                /*!< 0x00000080 */
#define RCC_PLL2CSGR_MOD_PER_8                    (0x100U << RCC_PLL2CSGR_MOD_PER_Pos)               /*!< 0x00000100 */
#define RCC_PLL2CSGR_MOD_PER_9                    (0x200U << RCC_PLL2CSGR_MOD_PER_Pos)               /*!< 0x00000200 */
#define RCC_PLL2CSGR_MOD_PER_10                   (0x400U << RCC_PLL2CSGR_MOD_PER_Pos)               /*!< 0x00000400 */
#define RCC_PLL2CSGR_MOD_PER_11                   (0x800U << RCC_PLL2CSGR_MOD_PER_Pos)               /*!< 0x00000800 */
#define RCC_PLL2CSGR_MOD_PER_12                   (0x1000U << RCC_PLL2CSGR_MOD_PER_Pos)              /*!< 0x00001000 */
#define RCC_PLL2CSGR_TPDFN_DIS_Pos                (13U)
#define RCC_PLL2CSGR_TPDFN_DIS_Msk                (0x1U << RCC_PLL2CSGR_TPDFN_DIS_Pos)               /*!< 0x00002000 */
#define RCC_PLL2CSGR_TPDFN_DIS                    RCC_PLL2CSGR_TPDFN_DIS_Msk                         /*!< Dithering TPDF noise control */
#define RCC_PLL2CSGR_RPDFN_DIS_Pos                (14U)
#define RCC_PLL2CSGR_RPDFN_DIS_Msk                (0x1U << RCC_PLL2CSGR_RPDFN_DIS_Pos)               /*!< 0x00004000 */
#define RCC_PLL2CSGR_RPDFN_DIS                    RCC_PLL2CSGR_RPDFN_DIS_Msk                         /*!< Dithering RPDF noise control */
#define RCC_PLL2CSGR_SSCG_MODE_Pos                (15U)
#define RCC_PLL2CSGR_SSCG_MODE_Msk                (0x1U << RCC_PLL2CSGR_SSCG_MODE_Pos)               /*!< 0x00008000 */
#define RCC_PLL2CSGR_SSCG_MODE                    RCC_PLL2CSGR_SSCG_MODE_Msk                         /*!< Spread spectrum clock generator mode */
#define RCC_PLL2CSGR_INC_STEP_Pos                 (16U)
#define RCC_PLL2CSGR_INC_STEP_Msk                 (0x7FFFU << RCC_PLL2CSGR_INC_STEP_Pos)             /*!< 0x7FFF0000 */
#define RCC_PLL2CSGR_INC_STEP                     RCC_PLL2CSGR_INC_STEP_Msk                          /*!< Modulation Depth Adjustment for PLL2 */
#define RCC_PLL2CSGR_INC_STEP_0                   (0x1U << RCC_PLL2CSGR_INC_STEP_Pos)            /*!< 0x00010000 */
#define RCC_PLL2CSGR_INC_STEP_1                   (0x2U << RCC_PLL2CSGR_INC_STEP_Pos)            /*!< 0x00020000 */
#define RCC_PLL2CSGR_INC_STEP_2                   (0x4U << RCC_PLL2CSGR_INC_STEP_Pos)            /*!< 0x00040000 */
#define RCC_PLL2CSGR_INC_STEP_3                   (0x8U << RCC_PLL2CSGR_INC_STEP_Pos)            /*!< 0x00080000 */
#define RCC_PLL2CSGR_INC_STEP_4                   (0x10U << RCC_PLL2CSGR_INC_STEP_Pos)           /*!< 0x00100000 */
#define RCC_PLL2CSGR_INC_STEP_5                   (0x20U << RCC_PLL2CSGR_INC_STEP_Pos)           /*!< 0x00200000 */
#define RCC_PLL2CSGR_INC_STEP_6                   (0x40U << RCC_PLL2CSGR_INC_STEP_Pos)           /*!< 0x00400000 */
#define RCC_PLL2CSGR_INC_STEP_7                   (0x80U << RCC_PLL2CSGR_INC_STEP_Pos)           /*!< 0x00800000 */
#define RCC_PLL2CSGR_INC_STEP_8                   (0x100U << RCC_PLL2CSGR_INC_STEP_Pos)          /*!< 0x01000000 */
#define RCC_PLL2CSGR_INC_STEP_9                   (0x200U << RCC_PLL2CSGR_INC_STEP_Pos)          /*!< 0x02000000 */
#define RCC_PLL2CSGR_INC_STEP_10                  (0x400U << RCC_PLL2CSGR_INC_STEP_Pos)          /*!< 0x04000000 */
#define RCC_PLL2CSGR_INC_STEP_11                  (0x800U << RCC_PLL2CSGR_INC_STEP_Pos)          /*!< 0x08000000 */
#define RCC_PLL2CSGR_INC_STEP_12                  (0x1000U << RCC_PLL2CSGR_INC_STEP_Pos)         /*!< 0x10000000 */
#define RCC_PLL2CSGR_INC_STEP_13                  (0x2000U << RCC_PLL2CSGR_INC_STEP_Pos)         /*!< 0x20000000 */
#define RCC_PLL2CSGR_INC_STEP_14                  (0x4000U << RCC_PLL2CSGR_INC_STEP_Pos)         /*!< 0x40000000 */

